#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Управление(Команда)
	
	Форма = ПолучитьФорму("ВнешняяОбработка.ВзаимодействиеСEMEX.Форма.ФормаТестированияWebСервисов", , ЭтаФорма);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьВнешнююОбработку();
КонецПроцедуры

&НаКлиенте
Процедура НайтиДеталь(Команда)
	НайтиДетальНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьИмяФайла()
	
	Возврат РеквизитФормыВЗначение("Объект").ИспользуемоеИмяФайла;
	
КонецФункции

&НаСервере
Процедура ПодключитьОбработкуНаСервере(АдресХранилища)
	
	ЗащитаОтОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий;
	ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
	ВнешниеОбработки.Подключить(АдресХранилища,, Ложь, ЗащитаОтОпасныхДействий);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеПомещенияФайлаОбработки(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры)
	
	ПодключитьОбработкуНаСервере(Адрес);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьВнешнююОбработку()
	
	ИмяФайлаОбработки = ПолучитьИмяФайла();
	АдресХранилища = "";
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗавершениеПомещенияФайлаОбработки", ЭтаФорма), АдресХранилища, ИмяФайлаОбработки, Ложь, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура НайтиДетальНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("login", Объект.Логин);
	СтруктураПараметров.Вставить("password", Объект.Пароль);
	СтруктураПараметров.Вставить("makeLogo","");
	СтруктураПараметров.Вставить("detailNum", НомерДетали);
	СтруктураПараметров.Вставить("substLevel","All");
	СтруктураПараметров.Вставить("substFilter","None");
	СтруктураПараметров.Вставить("deliveryRegionType", "PRI");
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ВыполнитьКомандуWebСервиса("FindDetailAdv3", СтруктураПараметров, РезультатПоиска);
	
КонецПроцедуры


#КонецОбласти
